src/Catalogs/рнсНастройкиВыполненияПравил/рнсНастройкиВыполненияПравил.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсНастройкиВыполненияПравил</name>
  <basedOn>Catalog.рнсПравилаПолученияДанныхИБ</basedOn>
  <owners>Catalog.рнсПравилаПолученияДанныхИБ</owners>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеНаборы</name>
    <attributes>
      <name>ИмяНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучитьПоПравилу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеВнешнегоНабора</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Правило</name>
      <type>
        <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВыполнения</name>
      <type>
        <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыВложенныхПравил</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/рнсВариантВыполненияПравила/рнсВариантВыполненияПравила.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рнсВариантВыполненияПравила</name>
  <enumValues>
    <name>СхемаКомпоновки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСОбъединением</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСУсловием</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/рнсНастройкиВыполненияПравил/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.рнсПравилаПолученияДанныхИБ") Тогда  	
		Владелец = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	      
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	РеквизитыПравила 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "СхемаКомпоновкиДанных, ВариантВыполнения");
	Схема 		 			= РеквизитыПравила.СхемаКомпоновкиДанных.Получить();
	Настройки	 			= ХранилищеНастроекКомпоновкиДанных.Получить();
		
	Если ЭтоНовый() Тогда
		КонтрольнаяСуммаПередЗаписью = "";
	Иначе
		КонтрольнаяСуммаПередЗаписью = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КонтрольнаяСумма");	
	КонецЕсли;  	
	
	Если Схема = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не задана схема компоновки данных у владельца %1'"), Владелец);	
	Иначе
		Если РеквизитыПравила.ВариантВыполнения <> Перечисления.рнсВариантВыполненияПравила.СхемаКомпоновки 
			И НЕ рнсСлужебный.ЭтоСложнаяСхема(Схема, Настройки) Тогда
		
			КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных; 	
			МакетКомпоновки 	= КомпоновщикМакета.Выполнить(Схема, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));  			
			ТекстЗапросаМакета 	= МакетКомпоновки.НаборыДанных[Схема.НаборыДанных[0].Имя].Запрос;	
			
			ЗаполнитьНастройкуВыполнения(ТекстЗапросаМакета, МакетКомпоновки.ЗначенияПараметров, Настройки.ПараметрыДанных.Элементы,  "Р");	
					                               		
			Данные = Новый Структура;
			Данные.Вставить("Схема", Схема);    
			Данные.Вставить("НастройкаСхемы", Настройки);			
			
			КонтрольнаяСумма = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Данные); 
			
			Если КонтрольнаяСумма = КонтрольнаяСуммаПередЗаписью Тогда  				
				Если ТекстЗапроса <> ТекстЗапросаМакета Тогда
					Если НЕ ЗначениеЗаполнено(ТекстЗапроса) Тогда
						ТекстЗапроса = ТекстЗапросаМакета;	
					КонецЕсли;	
				КонецЕсли;  			
			Иначе
				ТекстЗапроса = ТекстЗапросаМакета;
			КонецЕсли; 
			
			ИзмененаВручную = ЗначениеЗаполнено(ТекстЗапроса) И ТекстЗапроса <> ТекстЗапросаМакета;	
			
		Иначе 
			ИзмененаВручную			= Ложь;
			ТекстЗапроса 			= "";
			ХранилищеПараметров 	= Новый ХранилищеЗначения(Неопределено);					
		КонецЕсли;		  	
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти  
         
#Область СлужебныеПроцедурыИФункции   

Процедура ЗаполнитьНастройкуВыполнения(ТекстЗапросаМакета, ПараметрыИзМакета, ПараметрыДанных, ПрефиксПараметра)
	
	НПП 							= 1;
	КоллекцияПараметрЗначение 		= Новый Структура;
	КоллекцияПараметров				= Новый Структура;
	СписокПараметров 				= Новый СписокЗначений;  
	ПараметрыСхемы					= Новый Структура;
	
	Для каждого Ит Из ПараметрыДанных Цикл  
		ПараметрыСхемы.Вставить(Строка(Ит.Параметр), ЗначениеЗаполнено(Ит.ИдентификаторПользовательскойНастройки));				
	КонецЦикла;
	
	Для каждого Ит Из ПараметрыИзМакета Цикл   		
		
		Использовать = Неопределено;
		
		Если ПараметрыСхемы.Свойство(Ит.Имя, Использовать) Тогда 
			Если Не Использовать Тогда // пользовательские параметры исключаю из хранения в настройке
				КоллекцияПараметрЗначение.Вставить(Ит.Имя, Ит.Значение); 	
			КонецЕсли;						
		Иначе 				
			// параметры для отборов   		
			КоллекцияПараметров.Вставить(Ит.Имя, Ит.Значение); 		
			СписокПараметров.Добавить(Ит.Имя);			
		КонецЕсли;		 
		
	КонецЦикла; 
	
	СписокПараметров.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	// замена имен параметров
	
	Для каждого ЭлементСписка Из СписокПараметров Цикл
		
		ИмяПараметра 			= "&" + ЭлементСписка.Значение;
		НовоеИмяПараметра 		= ПрефиксПараметра + Формат(НПП, "ЧЦ=12; ЧДЦ=0; ЧВН=; ЧГ=0");
		МассивПозиций 			= ПолучитьМассивПозицийПодстроки(ТекстЗапросаМакета, ИмяПараметра);
		ДлинаИмени 				= СтрДлина(ИмяПараметра);
		
		Если ЗначениеЗаполнено(МассивПозиций) Тогда 			
		 
			Если МассивПозиций.Количество() = 1 Тогда
				ТекстЗапросаМакета = СтрЗаменить(ТекстЗапросаМакета, ИмяПараметра, "&" + НовоеИмяПараметра);		
			Иначе                                                                  
				Для каждого Ит Из МассивПозиций Цикл  
					
					ПозицияПроверяемогоСимвола  = Ит + ДлинаИмени;
					ДлинаТекстаЗапроса 			= СтрДлина(ТекстЗапросаМакета);   
					
					Если НЕ рнсСлужебный.СимволУдовлетворяетТребованиюИдентификатора(КодСимвола(ТекстЗапросаМакета, ПозицияПроверяемогоСимвола)) Тогда
						ТекстЗапросаМакета = Лев(ТекстЗапросаМакета, Ит - 1) + "&" + НовоеИмяПараметра + Прав(ТекстЗапросаМакета, ДлинаТекстаЗапроса - ПозицияПроверяемогоСимвола + 1);												
					КонецЕсли;	
					
				КонецЦикла; 	
			КонецЕсли; 	
			
			КоллекцияПараметрЗначение.Вставить(НовоеИмяПараметра, КоллекцияПараметров[ЭлементСписка.Значение]);
			
			НПП = НПП + 1;
		
		КонецЕсли;  
		
	КонецЦикла;
	
	ХранилищеПараметров = Новый ХранилищеЗначения(КоллекцияПараметрЗначение, Новый СжатиеДанных(9));	
	
КонецПроцедуры  
			
Функция ПолучитьМассивПозицийПодстроки(ИсходнаяСтрока, ПодстрокаПоиска)
	
	СписокВхождений = Новый СписокЗначений;
    ЧислоВхождений = СтрЧислоВхождений(ИсходнаяСтрока, ПодстрокаПоиска);
	ДлинаСтрокиПоиска = СтрДлина(ПодстрокаПоиска);
	
	Если ЧислоВхождений > 0 И ЗначениеЗаполнено(ИсходнаяСтрока) Тогда		
		
		ОгрызокСтроки = ИсходнаяСтрока;
		Поправка = 0;
		
		Для Ит = 1 По ЧислоВхождений Цикл
		    
			ПозицияПодстроки = СтрНайти(ОгрызокСтроки, ПодстрокаПоиска);
			Если ПозицияПодстроки > 0 Тогда				
				СписокВхождений.Добавить(ПозицияПодстроки + Поправка);
				ОгрызокСтроки = Прав(ОгрызокСтроки, СтрДлина(ОгрызокСтроки) - ПозицияПодстроки - ДлинаСтрокиПоиска + 1);
				Поправка = Поправка + ПозицияПодстроки + ДлинаСтрокиПоиска - 1;
			КонецЕсли;
		
		КонецЦикла; 	   
	КонецЕсли;  	
	
	СписокВхождений.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Возврат СписокВхождений.ВыгрузитьЗначения();

КонецФункции

#КонецОбласти

#КонецЕсли
